Repository: whatznottechnology/flutter_medicine_tracker_MEDI_TIME
Catalog: lib/l10n/app_*.arb
Languages: bn

# appTitle
source: Medi Time
bn: ওষুধ ট্র্যাকার

# welcome
source: Welcome to Medi Time
bn: ওষুধ ট্র্যাকারে স্বাগতম

# welcomeDescription
source: Your personal medicine and health companion
bn: আপনার দৈনন্দিন ওষুধ ও স্বাস্থ্যের সাথী

source: Get Started
bn: শুরু করুন

source: Next
bn: পরবর্তী

source: Previous
bn: আগের

source: Skip
bn: ছাড়ুন

source: Finish
bn: শেষ

# continueBtn
source: Continue
bn: এগিয়ে যান

source: Cancel
bn: বাতিল

source: Save
bn: সেভ করুন

source: Edit
bn: এডিট

source: Delete
bn: মুছে দিন

source: Confirm
bn: নিশ্চিত

source: Yes
bn: হ্যাঁ

source: No
bn: না

source: OK
bn: ঠিক আছে

# onboardingTitle1
source: Never Miss a Dose
bn: কোনো ডোজ মিস করবেন না

# onboardingDesc1
source: Set personalized reminders for all your medications and stay on track with your health routine.
bn: সব ওষুধের জন্য রিমাইন্ডার সেট করুন আর নিয়মিত ওষুধ খাওয়ার অভ্যাস বজায় রাখুন।

# onboardingTitle2
source: Track Your Health
bn: স্বাস্থ্য ট্র্যাক করুন

# onboardingDesc2
source: Monitor your medicine intake, water consumption, and build healthy habits effortlessly.
bn: ওষুধ খাওয়া, পানি পান আর স্বাস্থ্যকর অভ্যাস সহজে ট্র্যাক করুন।

# onboardingTitle3
source: Stay Organized
bn: সব কিছু গোছানো রাখুন

# onboardingDesc3
source: Manage your medicine stock, get low stock alerts, and keep all your health data in one place.
bn: ওষুধের স্টক দেখুন, কমে গেলে সতর্কতা পান আর সব ডেটা এক জায়গায় রাখুন।

# personalizeExperience
source: Let's Personalize Your Experience
bn: আপনার মতো করে সেট করুন

# personalizeDescription
source: Tell us a bit about yourself to get the most out of Medi Time
bn: সবচেয়ে ভালো সুবিধা পেতে আপনার সম্পর্কে কিছু তথ্য দিন

source: Your Name
bn: আপনার নাম

source: Enter your name
bn: নাম লিখুন

source: Select Language
bn: ভাষা বেছে নিন

source: Notifications
bn: নোটিফিকেশন

source: Enable Notifications
bn: নোটিফিকেশন চালু করুন

# notificationsDescription
source: Get timely reminders for your medicines
bn: ওষুধের সময় হলে রিমাইন্ডার পাবেন

source: Water Reminders
bn: জলের রিমাইন্ডার

source: Enable Water Reminders
bn: জলের রিমাইন্ডার চালু করুন

# waterRemindersDescription
source: Stay hydrated with regular water reminders
bn: নিয়মিত জল খাওয়ার জন্য রিমাইন্ডার পাবেন

source: Dashboard
bn: হোম

source: medicines
bn: ওষুধসমূহ

source: Water
bn: জল

source: History
bn: হিস্টরি

source: Settings
bn: সেটিংস

source: Good Morning
bn: সুপ্রভাত

source: Good Afternoon
bn: শুভ বিকাল

source: Good Evening
bn: শুভ সন্ধ্যা

source: Good Night
bn: শুভ রাত্রি

source: Upcoming Medicines
bn: পরবর্তী ওষুধ

source: Water Progress
bn: জল খাওয়ার অগ্রগতি

source: Adherence Rate
bn: নিয়মিততা

source: Quick Actions
bn: দ্রুত কাজ

source: Add Medicine
bn: ওষুধ যোগ করুন

source: Log Water
bn: জল রেকর্ড করুন

source: View History
bn: হিস্টরি দেখুন

source: Medicine Name
bn: ওষুধের নাম

source: Dose
bn: ডোজ

source: Medicine Type
bn: ওষুধের ধরন

source: Timing
bn: সময়

source: Before Meal
bn: খাওয়ার আগে

source: After Meal
bn: খাওয়ার পরে

source: With Meal
bn: খাওয়ার সাথে

# independent
source: Anytime
bn: যেকোনো সময়

source: Current Stock
bn: বর্তমান স্টক

source: Low Stock Threshold
bn: কম স্টকের সীমা

source: Enable Alerts
bn: রিমাইন্ডার চালু করুন

source: Enable Low Stock Alerts
bn: স্টক কমলে জানান

source: Upload Image
bn: ছবি যোগ করুন

source: Tablet
bn: ট্যাবলেট

source: Capsule
bn: ক্যাপসুল

# liquid
source: Liquid (ml)
bn: সিরাপ (মিলি)

source: Injection
bn: ইনজেকশন

source: Drops
bn: ড্রপ

# cream
source: Cream/Gel
bn: ক্রিম/মলম

source: Spray
bn: স্প্রে

# powder
source: Powder (g)
bn: পাউডার (গ্রাম)

source: Other
bn: অন্যান্য

source: Taken
bn: খেয়েছেন

source: Missed
bn: মিস করেছেন

source: Skipped
bn: ছেড়ে দিয়েছেন

source: Scheduled
bn: নির্ধারিত

source: Low Stock Alert
bn: স্টক কম সতর্কতা

source: Out of Stock
bn: স্টক শেষ

# refillReminder
source: Please refill your medicine
bn: দয়া করে ওষুধ কিনে নিন

source: No upcoming medicines
bn: এখন কোনো ওষুধ নেই

source: Water logged!
bn: জল রেকর্ড হয়েছে!

source: Low Stock
bn: স্টক কম

# addFirstMedicine
source: Add your first medicine to get started with tracking
bn: প্রথম ওষুধ যোগ করুন আর ট্র্যাকিং শুরু করুন

# medicineMarkedTaken
source: Medicine marked as taken
bn: ওষুধ খাওয়া হয়েছে বলে চিহ্নিত

# medicineMarkedSkipped
source: Medicine marked as skipped
bn: ওষুধ ছাড়া হয়েছে বলে চিহ্নিত

source: UNDO
bn: আগের অবস্থা

source: Mark Taken
bn: খেয়েছি

source: Skip Dose
bn: এবার ছাড়ছি

source: Overdue
bn: সময় পার হয়েছে

source: Snoozed
bn: একটু পরে

source: Today is
bn: আজ

# stayHealthy
source: Stay healthy and take your medicines on time!
bn: সুস্থ থাকুন আর নিয়মিত ওষুধ খান!

source: Something went wrong
bn: কিছু সমস্যা হয়েছে

source: Try Again
bn: আবার চেষ্টা করুন

source: No medicines added
bn: এখনো কোনো ওষুধ যোগ করা হয়নি

# addYourFirstMedicine
source: Add your first medicine and start tracking
bn: প্রথম ওষুধ যোগ করুন আর ট্র্যাকিং শুরু করুন

# skipMedicine
source: Skip
bn: ছাড়ছি

source: Select Time
bn: সময় নির্বাচন করুন

source: Select Date
bn: তারিখ নির্বাচন করুন

source: AM
bn: সকাল

source: PM
bn: বিকেল

# setMealTimes
source: Meal Times & Alerts
bn: খাবারের সময় নির্ধারণ করুন

# setMealTimesDescription
source: Set your meal times for medicine reminders
bn: ঔষধের রিমাইন্ডারের জন্য আপনার খাবারের সময় নির্ধারণ করুন

source: Breakfast
bn: সকালের খাবার

source: Lunch
bn: দুপুরের খাবার

source: Dinner
bn: রাতের খাবার

source: Back
bn: ফিরুন

source: Start Tracking
bn: ট্র্যাকিং শুরু করুন

source: Edit Medicine
bn: ওষুধ এডিট করুন

source: Update Medicine
bn: ওষুধ আপডেট করুন

source: Medicine Form
bn: ওষুধের ধরন

source: Relation to Food
bn: খাওয়ার সাথে সম্পর্ক

# addAtLeastOneTime
source: Add at least one reminder time
bn: অন্তত একটা সময় দিন

source: Add Time
bn: সময় যোগ করুন

source: Please enter medicine name
bn: ওষুধের নাম লিখুন

# pleaseEnterDose
source: Please enter dose information
bn: ডোজের তথ্য লিখুন

# pleaseAddScheduleTime
source: Please add at least one schedule time
bn: অন্তত একটা সময় দিন

source: Medicine updated successfully
bn: ওষুধ আপডেট হয়ে গেছে

source: Medicine added successfully
bn: ওষুধ যোগ হয়ে গেছে

source: Change Photo
bn: ছবি বদলান

source: Remove Photo
bn: ছবি সরান

source: Tap to add photo
bn: ছবি যোগ করতে চাপুন

source: Enter valid stock amount
bn: সঠিক স্টক সংখ্যা দিন

source: Enter valid threshold
bn: সঠিক সীমা দিন

source: Alert Settings
bn: রিমাইন্ডার সেটিংস

source: Medicine Alerts
bn: ওষুধের রিমাইন্ডার

# getMedicineReminders
source: Get reminders for this medicine
bn: এই ওষুধের জন্য রিমাইন্ডার পান

source: Low Stock Alerts
bn: স্টক কম হলে জানান

# getNotifiedLowStock
source: Get notified when stock is low
bn: স্টক কমে গেলে জানান

source: Close
bn: বন্ধ

source: Delete Medicine
bn: ওষুধ মুছে দিন

source: Water Intake
bn: জল পান

source: Add Glass
bn: গ্লাস যোগ করুন

source: Removed one glass
bn: এক গ্লাস বাদ দেওয়া হয়েছে

source: Remove last glass
bn: শেষ গ্লাস বাদ দিন

source: Adherence Overview
bn: নিয়মিততার সারসংক্ষেপ

source: Medicine Adherence
bn: ওষুধ খাওয়ার নিয়মিততা

source: Water Goal Achievement
bn: জলের লক্ষ্য অর্জন

source: Water Goal Streak
bn: জলের লক্ষ্যের ধারাবাহিকতা

# startStreakToday
source: Start your streak today
bn: আজ থেকে ধারাবাহিকতা শুরু করুন

# medicineWaterReminders
source: Medicine and water reminders
bn: ওষুধ আর জলের রিমাইন্ডার

source: Sound
bn: আওয়াজ

# playSoundNotifications
source: Play sound for notifications
bn: নোটিফিকেশনে আওয়াজ চালু করুন

source: Vibration
bn: ভাইব্রেশন

# vibrateNotifications
source: Vibrate for notifications
bn: নোটিফিকেশনে ভাইব্রেশন চালু করুন

source: Snooze Duration
bn: কিছুক্ষণ পরে দেখানোর সময়

source: Water Tracking
bn: জল ট্র্যাকিং

source: Daily Target
bn: দিনের টার্গেট

source: Regular hydration reminders
bn: নিয়মিত জল খাওয়ার রিমাইন্ডার

source: Data Management
bn: ডেটা ম্যানেজমেন্ট

source: Export Data
bn: ডেটা এক্সপোর্ট করুন

# downloadDataAsJSON
source: Download your data as JSON
bn: আপনার ডেটা JSON ফাইলে ডাউনলোড করুন

source: Reset Settings
bn: সেটিংস রিসেট করুন

source: Restore default settings
bn: আগের সেটিংস ফিরিয়ে আনুন

source: Clear All Data
bn: সব ডেটা মুছে দিন

# deleteAllMedicinesHistory
source: Delete all medicines and history
bn: সব ওষুধ আর হিস্টরি মুছে দিন

source: Minutes
bn: মিনিট

source: min
bn: মিনিট

source: Glasses per day
bn: দিনে গ্লাস

source: glasses
bn: গ্লাস

source: Settings reset to default
bn: সেটিংস আগের অবস্থায় ফিরে গেছে

source: Reset
bn: রিসেট

source: Clear All
bn: সব মুছুন

source: All data cleared
bn: সব ডেটা মুছে দেওয়া হয়েছে

source: Language
bn: ভাষা

source: Last 7 days
bn: গত ৭ দিন

source: Last 30 days
bn: গত ৩০ দিন

source: Last 90 days
bn: গত ৯০ দিন

# waterHistory
source: Water
bn: জলের হিস্টরি

# medicineHistory
source: Medicines
bn: ওষুধের হিস্টরি

source: No history data
bn: কোনো হিস্টরি ডেটা নেই

# noMedicineHistory
source: No medicine history for this period
bn: এই সময়ে কোনো ওষুধের হিস্টরি নেই

# noWaterHistory
source: No water history for this period
bn: এই সময়ে কোনো জলের হিস্টরি নেই

source: Total glasses
bn: মোট গ্লাস

# medicineNameLabel
source: Medicine Name *
bn: ওষুধের নাম *

# medicineNameHint
source: e.g., Aspirin, Vitamin D
bn: যেমন, প্যারাসিটামল, ভিটামিন সি

# doseLabel
source: Dose:
bn: ডোজ:

# doseHint
source: e.g., 1 tablet, 5 ml, 500mg
bn: যেমন, ১টি ট্যাবলেট, ৫ মিলি, ৫০০মিগ্রা

# medicineFormLabel
source: Medicine Form
bn: ওষুধের ধরন

# relationToFoodLabel
source: Relation to Food
bn: খাওয়ার সাথে সম্পর্ক

# scheduleTimesLabel
source: Schedule Times *
bn: কখন খাবেন *

# addAtLeastOneTimeHint
source: Add at least one reminder time
bn: অন্তত একটা সময় দিন

# addTimeButton
source: Add Time
bn: সময় যোগ করুন

# notesLabel
source: Notes (Optional)
bn: নোট (যদি চান)

# notesHint
source: Any additional information...
bn: কোনো বিশেষ তথ্য থাকলে লিখুন...

source: Medicine Photo (Optional)
bn: ওষুধের ছবি (যদি চান)

source: Stock Management (Optional)
bn: স্টক ট্র্যাকিং (যদি চান)

# currentStockLabel
source: Current Stock
bn: এখন কতটুকু আছে

# lowStockAlertLabel
source: Low Stock Alert
bn: কম হলে জানান

# alertSettingsLabel
source: Alert Settings
bn: রিমাইন্ডার সেটিংস

# medicineAlertsTitle
source: Medicine Alerts
bn: ওষুধের রিমাইন্ডার

# medicineAlertsSubtitle
source: Get reminders for this medicine
bn: এই ওষুধের জন্য রিমাইন্ডার পাবেন

# lowStockAlertsTitle
source: Low Stock Alerts
bn: স্টক কমলে জানান

# lowStockAlertsSubtitle
source: Get notified when stock is low
bn: স্টক কমে গেলে জানিয়ে দেবো

# updateMedicineButton
source: Update Medicine
bn: ওষুধ আপডেট করুন

# addMedicineButton
source: Add Medicine
bn: ওষুধ যোগ করুন

source: Error picking image:
bn: ছবি সিলেক্ট করতে সমস্যা:

# changePhotoButton
source: Change Photo
bn: ছবি বদলান

# removePhotoButton
source: Remove Photo
bn: ছবি সরান

# tapToAddPhotoText
source: Tap to add photo
bn: ছবি যোগ করতে চাপুন

# scheduledLabel
source: Scheduled:
bn: নির্ধারিত:

# actualLabel
source: Actual:
bn: আসলে:

source: Unknown Medicine
bn: অজানা ওষুধ

# unknownDose
source: Unknown
bn: জানা নেই

# ofGlasses
source: of
bn: এর মধ্যে

# glassesText
source: glasses
bn: গ্লাস

source: Target reached
bn: টার্গেট পূরণ

source: Target not reached
bn: টার্গেট পূরণ হয়নি

source: Water Tracker
bn: জল ট্র্যাকার

# quickActionsTitle
source: Quick Actions
bn: দ্রুত কাজ

# addGlassButton
source: Add Glass
bn: গ্লাস যোগ করুন

# removeButton
source: Remove
bn: বাদ দিন

# changeTargetButton
source: Change Target
bn: টার্গেট বদলান

source: Glass added!
bn: গ্লাস যোগ হয়েছে!

source: Glass removed!
bn: গ্লাস বাদ দেওয়া হয়েছে!

source: Set Water Target
bn: জলের টার্গেট ঠিক করুন

# glassesPerDayLabel
source: Glasses per day
bn: দিনে গ্লাস

# glassesUnit
source: glasses
bn: গ্লাস

# adherenceOverviewTitle
source: Adherence Overview
bn: নিয়মিততার সারসংক্ষেপ

# medicineAdherenceTitle
source: Medicine Adherence
bn: ওষুধ খাওয়ার নিয়মিততা

# waterGoalAchievementTitle
source: Water Goal Achievement
bn: জলের লক্ষ্য অর্জন

# waterGoalStreakTitle
source: Water Goal Streak
bn: জলের টার্গেট স্ট্রিক

source: consecutive days!
bn: দিন একটানা!

# startStreakTodayText
source: Start your streak today
bn: আজ থেকে স্ট্রিক শুরু করুন

source: No medicine history yet
bn: এখনো কোনো ওষুধের হিস্টরি নেই

source: No water history yet
bn: এখনো কোনো জলের হিস্টরি নেই

source: Select Image Source
bn: ছবি কোথা থেকে নেবেন?

source: Gallery
bn: গ্যালারি

source: Camera
bn: ক্যামেরা

# ofTarget
source: of
bn: এর মধ্যে

# percentOfDailyGoal
source: % of daily goal
bn: % দিনের টার্গেটের

source: Goal achieved!
bn: টার্গেট পূরণ!

source: Next doses due
bn: পরবর্তী ডোজ

# allCaughtUp
source: You're all caught up!
bn: সব ঠিক আছে!

source: medicine
bn: ওষুধ

source: Medicine skipped
bn: ওষুধ ছাড়া হয়েছে
